"""
Задача 6: Вы пользуетесь общественным транспортом? 
Вероятно, вы расплачивались за проезд и получали билет с номером. 
Счастливым билетом называют такой билет с шестизначным номером, 
где сумма первых трех цифр равна сумме последних трех. 
Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
Вам требуется написать программу, которая проверяет счастливость билета.
"""

ticket_number = int(input("Введите 6-тизначный номер билета: "))
first_part = ticket_number//1000
second_part = ticket_number%1000
print(first_part)
print(second_part)

def sum_of_num (n):
    sum = 0
    while n > 0:
        sum = sum + n%10
        n = n // 10
    print(sum)
    return sum

if sum_of_num(first_part)==sum_of_num(second_part):
    print("Поздравляем Ваш билет № "+str(ticket_number)+" победный")
else:
    print("Неудача. Побробуй еще раз")